# Exercise

In [1]:
import pandas as pd
import numpy as np

In [2]:
city_names = pd.Series(['San Francisco', 'San Jose', 'Sacramento'])
population = pd.Series([852469, 1015785, 485199])

city_names

0    San Francisco
1         San Jose
2       Sacramento
dtype: object

In [3]:
city_df = pd.DataFrame({'City name': city_names, 'Population': population})

city_df

       City name  Population
0  San Francisco      852469
1       San Jose     1015785
2     Sacramento      485199

In [4]:
print(type(city_df['City name']))
print('')

print(city_df['City name'])
print('')

print(city_df['City name'][0])
print('')

print(type(city_df[0:2]))
print('')

print((city_df[0:1]))

<class 'pandas.core.series.Series'>

0    San Francisco
1         San Jose
2       Sacramento
Name: City name, dtype: object

San Francisco

<class 'pandas.core.frame.DataFrame'>

       City name  Population
0  San Francisco      852469

In [5]:
population / 1000

0     852.469
1    1015.785
2     485.199
dtype: float64

In [6]:
population.apply(lambda val: val > 1000000)

0    False
1     True
2    False
dtype: bool

In [7]:
city_df['Area square miles'] = pd.Series([46.87, 176.53, 97.92])
city_df['Population density'] = city_df['Population'] / city_df['Area square miles']
city_df

       City name  Population  Area square miles  Population density
0  San Francisco      852469              46.87        18187.945381
1       San Jose     1015785             176.53         5754.177760
2     Sacramento      485199              97.92         4955.055147

In [8]:
city_df['ans'] = (city_df['Area square miles'] > 50) & (city_df['City name'].apply(lambda name: name.startswith('San')))
city_df

       City name  Population  Area square miles  Population density    ans
0  San Francisco      852469              46.87        18187.945381  False
1       San Jose     1015785             176.53         5754.177760   True
2     Sacramento      485199              97.92         4955.055147  False

In [9]:
city_df.reindex([2, 0, 1])

       City name  Population  Area square miles  Population density    ans
2     Sacramento      485199              97.92         4955.055147  False
0  San Francisco      852469              46.87        18187.945381  False
1       San Jose     1015785             176.53         5754.177760   True

In [10]:
city_df.reindex(np.random.permutation(city_df.index))

       City name  Population  Area square miles  Population density    ans
0  San Francisco      852469              46.87        18187.945381  False
1       San Jose     1015785             176.53         5754.177760   True
2     Sacramento      485199              97.92         4955.055147  False

In [11]:
city_df.reindex([0, 4, 5, 2])

       City name  Population  Area square miles  Population density    ans
0  San Francisco    852469.0              46.87        18187.945381  False
4            NaN         NaN                NaN                 NaN    NaN
5            NaN         NaN                NaN                 NaN    NaN
2     Sacramento    485199.0              97.92         4955.055147  False

# Data description

In [12]:
# Usually we read data from somewhere, maybe DW
california_housing_df = pd.read_csv('https://storage.googleapis.com/mledu-datasets/california_housing_train.csv',
                                    sep=',')

In [13]:
california_housing_df.describe()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
count,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000
mean,-119.562108,35.625225,28.589353,2643.664412,539.410824,1429.573941,501.221941,3.883578,207300.912353
std,2.005166,2.137340,12.586937,2179.947071,421.499452,1147.852959,384.520841,1.908157,115983.764387
min,-124.350000,32.540000,1.000000,2.000000,1.000000,3.000000,1.000000,0.499900,14999.000000
25%,-121.790000,33.930000,18.000000,1462.000000,297.000000,790.000000,282.000000,2.566375,119400.000000
50%,-118.490000,34.250000,29.000000,2127.000000,434.000000,1167.000000,409.000000,3.544600,180400.000000
75%,-118.000000,37.720000,37.000000,3151.250000,648.250000,1721.000000,605.250000,4.767000,265000.000000
max,-114.310000,41.950000,52.000000,37937.000000,6445.000000,35682.000000,6082.000000,15.000100,500001.000000

In [14]:
california_housing_df.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
0,-114.31,34.19,15.0,5612.0,1283.0,1015.0,472.0,1.4936,66900.0
1,-114.47,34.40,19.0,7650.0,1901.0,1129.0,463.0,1.8200,80100.0
2,-114.56,33.69,17.0,720.0,174.0,333.0,117.0,1.6509,85700.0
3,-114.57,33.64,14.0,1501.0,337.0,515.0,226.0,3.1917,73400.0
4,-114.57,33.57,20.0,1454.0,326.0,624.0,262.0,1.9250,65500.0

In [15]:
california_housing_df.hist('housing_median_age')

array([[<matplotlib.axes._subplots.AxesSubplot object at 0x000001AD1414CCF8>]],
      dtype=object)